# Pandas loc & iloc

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Downloads/student_results.csv')
df

   Student ID  Class  Study hrs  Social Media usage hrs  Percantege
0        1001     10          2                       3          50
1        1002     10          6                       2          80
2        1003     10          3                       2          60
3        1004     11          0                       1          45
4        1005     11          4                       2          75

In [3]:
df.loc[0]

Student ID                1001
Class                       10
Study hrs                    2
Social Media usage hrs       3
Percantege                  50
Name: 0, dtype: int64

In [4]:
df.loc[4]

Student ID                1005
Class                       11
Study hrs                    4
Social Media usage hrs       2
Percantege                  75
Name: 4, dtype: int64

In [5]:
df.loc[[0,1]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percantege
0        1001     10          2                       3          50
1        1002     10          6                       2          80

In [6]:
df.loc[4, 'Class']

11

In [7]:
df.loc[0:2, 'Class']

0    10
1    10
2    10
Name: Class, dtype: int64

In [9]:
df.loc[[False, False, True, True, False]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percantege
2        1003     10          3                       2          60
3        1004     11          0                       1          45

In [12]:
df.loc[df['Class']<11, ['Percantege']]

   Percantege
0          50
1          80
2          60

In [13]:
df.iloc[[0]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percantege
0        1001     10          2                       3          50

In [14]:
df.iloc[:,0]

0    1001
1    1002
2    1003
3    1004
4    1005
Name: Student ID, dtype: int64

In [15]:
df.iloc[[0,1]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percantege
0        1001     10          2                       3          50
1        1002     10          6                       2          80

In [16]:
df.iloc[[True, True, False, False, True]]

   Student ID  Class  Study hrs  Social Media usage hrs  Percantege
0        1001     10          2                       3          50
1        1002     10          6                       2          80
4        1005     11          4                       2          75